[Killed] BlockStatement
lib/application.js:114:67
   this.on('mount', function onmount(parent) {
     // inherit trust proxy
     if (this.settings[trustProxyDefaultSymbol] === true
-      && typeof parent.settings['trust proxy fn'] === 'function') {
-      delete this.settings['trust proxy'];
-      delete this.settings['trust proxy fn'];
-    }
+      && typeof parent.settings['trust proxy fn'] === 'function') {}
 
     // inherit protos
killedBy: config .get() when mounted should inherit "trust proxy" setting
statusReason: false == [Function: fn]

[Killed] ConditionalExpression
lib/application.js:175:7
   setPrototypeOf(res, this.response)
 
   // setup locals
-  if (!res.locals) {
+  if (false) {
     res.locals = Object.create(null);
   }
killedBy: res should work when mounted
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/application.js:198:7
 
   // default path to '/'
   // disambiguate app.use([fn])
-  if (typeof fn !== 'function') {
+  if (false) {
     var arg = fn;
 
killedBy: app.parent should return the parent when mounted
statusReason: argument handler must be a function

[Killed] BlockStatement
lib/application.js:555:28
   }
 
   // primed cache
-  if (renderOptions.cache) {
-    view = cache[name];
-  }
+  if (renderOptions.cache) {}
 
   // view
killedBy: app .render(name, fn) caching should cache with "view cache" setting
statusReason: Expected values to be strictly equal:

2 !== 1

[Killed] BlockStatement
lib/application.js:579:30
     }
 
     // prime the cache
-    if (renderOptions.cache) {
-      cache[name] = view;
-    }
+    if (renderOptions.cache) {}
   }
 
killedBy: app .render(name, fn) caching should cache with "view cache" setting
statusReason: Expected values to be strictly equal:

2 !== 1
