[Killed] EqualityOperator
lib/request.js:263:21
   // support flattened arguments
   if (!Array.isArray(types)) {
     arr = new Array(arguments.length);
-    for (var i = 0; i < arr.length; i++) {
+    for (var i = 0; i >= arr.length; i++) {
       arr[i] = arguments[i];
     }
killedBy: req.is() when given a mime type should return the type when matching
statusReason: expected '"application/json"' response body, got 'false'

[Killed] ConditionalExpression
lib/request.js:438:16
   if (!host) return;
 
   // IPv6 literal support
-  var offset = host[0] === '['
+  var offset = false
     ? host.indexOf(']') + 1
     : 0;
killedBy: req .hostname should work with IPv6 Host
statusReason: expected '[::1]' response body, got '['
