[Killed] StringLiteral
lib/response.js:65:25
 res.status = function status(code) {
   // Check if the status code is not an integer
   if (!Number.isInteger(code)) {
-    throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
+    throw new TypeError(``);
   }
   // Check if the status code is outside of Node's valid range
killedBy: res .sendStatus(statusCode) should raise error for invalid status code
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] ConditionalExpression
lib/response.js:68:7
     throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
   }
   // Check if the status code is outside of Node's valid range
-  if (code < 100 || code > 999) {
+  if (true) {
     throw new RangeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be greater than 99 and less than 1000.`);
   }
killedBy: app .param(name, fn) should not call when values differ on error
statusReason: expected '0 1 err!' response body, got '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] BlockStatement
lib/response.js:95:29
  * @public
  */
 
-res.links = function(links) {
-  var link = this.get('Link') || '';
-  if (link) link += ', ';
-  return this.set('Link', link + Object.keys(links).map(function(rel) {
-    // Allow multiple links if links[rel] is an array
-    if (Array.isArray(links[rel])) {
-      return links[rel].map(function (singleLink) {
-        return `<${singleLink}>; rel="${rel}"`;
-      }).join(', ');
-    } else {
-      return `<${links[rel]}>; rel="${rel}"`;
-    }
-  }).join(', '));
-};
+res.links = function(links) {};
 
 /**
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" header field

[Killed] LogicalOperator
lib/response.js:96:14
  */
 
 res.links = function(links) {
-  var link = this.get('Link') || '';
+  var link = this.get('Link') && '';
   if (link) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel) {
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got "undefined<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last""

[Killed] BlockStatement
lib/response.js:98:71
 res.links = function(links) {
   var link = this.get('Link') || '';
   if (link) link += ', ';
-  return this.set('Link', link + Object.keys(links).map(function(rel) {
-    // Allow multiple links if links[rel] is an array
-    if (Array.isArray(links[rel])) {
-      return links[rel].map(function (singleLink) {
-        return `<${singleLink}>; rel="${rel}"`;
-      }).join(', ');
-    } else {
-      return `<${links[rel]}>; rel="${rel}"`;
-    }
-  }).join(', '));
+  return this.set('Link', link + Object.keys(links).map(function(rel) {}).join(', '));
 };
 
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got ","

[Killed] ArithmeticOperator
lib/response.js:98:27
 res.links = function(links) {
   var link = this.get('Link') || '';
   if (link) link += ', ';
-  return this.set('Link', link + Object.keys(links).map(function(rel) {
-    // Allow multiple links if links[rel] is an array
-    if (Array.isArray(links[rel])) {
-      return links[rel].map(function (singleLink) {
-        return `<${singleLink}>; rel="${rel}"`;
-      }).join(', ');
-    } else {
-      return `<${links[rel]}>; rel="${rel}"`;
-    }
-  }).join(', '));
+  return this.set('Link', link - Object.keys(links).map(function (rel) {
+  // Allow multiple links if links[rel] is an array
+  if (Array.isArray(links[rel])) {
+    return links[rel].map(function (singleLink) {
+      return `<${singleLink}>; rel="${rel}"`;
+    }).join(', ');
+  } else {
+    return `<${links[rel]}>; rel="${rel}"`;
+  }
+}).join(', '));
 };
 
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got "NaN"

[Killed] ConditionalExpression
lib/response.js:100:9
   if (link) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel) {
     // Allow multiple links if links[rel] is an array
-    if (Array.isArray(links[rel])) {
+    if (false) {
       return links[rel].map(function (singleLink) {
         return `<${singleLink}>; rel="${rel}"`;
killedBy: res .links(obj) should set multiple links for single rel

[Killed] ConditionalExpression
lib/response.js:100:9
   if (link) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel) {
     // Allow multiple links if links[rel] is an array
-    if (Array.isArray(links[rel])) {
+    if (true) {
       return links[rel].map(function (singleLink) {
         return `<${singleLink}>; rel="${rel}"`;
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" header field

[Killed] BlockStatement
lib/response.js:101:51
   return this.set('Link', link + Object.keys(links).map(function(rel) {
     // Allow multiple links if links[rel] is an array
     if (Array.isArray(links[rel])) {
-      return links[rel].map(function (singleLink) {
-        return `<${singleLink}>; rel="${rel}"`;
-      }).join(', ');
+      return links[rel].map(function (singleLink) {}).join(', ');
     } else {
       return `<${links[rel]}>; rel="${rel}"`;
killedBy: res .links(obj) should set multiple links for single rel
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last", <http://api.example.com/users?page=1>; rel="last"", got "<http://api.example.com/users?page=2>; rel="next", ,"

[Killed] BlockStatement
lib/response.js:104:12
       return links[rel].map(function (singleLink) {
         return `<${singleLink}>; rel="${rel}"`;
       }).join(', ');
-    } else {
-      return `<${links[rel]}>; rel="${rel}"`;
-    }
+    } else {}
   }).join(', '));
 };
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got ","

[Killed] StringLiteral
lib/response.js:105:14
         return `<${singleLink}>; rel="${rel}"`;
       }).join(', ');
     } else {
-      return `<${links[rel]}>; rel="${rel}"`;
+      return ``;
     }
   }).join(', '));
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got ","

[Killed] StringLiteral
lib/response.js:107:11
     } else {
       return `<${links[rel]}>; rel="${rel}"`;
     }
-  }).join(', '));
+  }).join(""));
 };
 
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got "<http://api.example.com/users?page=2>; rel="next"<http://api.example.com/users?page=5>; rel="last""

[Killed] StringLiteral
lib/response.js:134:10
 
   switch (typeof chunk) {
     // string defaulting to html
-    case 'string':
+    case "":
       if (!this.get('Content-Type')) {
         this.type('html');
killedBy: res .send(String) should send as html
statusReason: expected "Content-Type" header field

[Killed] ConditionalExpression
lib/response.js:135:11
   switch (typeof chunk) {
     // string defaulting to html
     case 'string':
-      if (!this.get('Content-Type')) {
+      if (false) {
         this.type('html');
       }
killedBy: res .send(String) should send as html
statusReason: expected "Content-Type" header field

[Killed] ConditionalExpression
lib/response.js:141:5
       break;
     case 'boolean':
     case 'number':
-    case 'object':
-      if (chunk === null) {
-        chunk = '';
-      } else if (ArrayBuffer.isView(chunk)) {
-        if (!this.get('Content-Type')) {
-          this.type('bin');
-        }
-      } else {
-        return this.json(chunk);
-      }
-      break;
+    case 'object':
   }
 
killedBy: app.router params should overwrite existing req.params by default
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/response.js:144:18
     case 'object':
       if (chunk === null) {
         chunk = '';
-      } else if (ArrayBuffer.isView(chunk)) {
+      } else if (false) {
         if (!this.get('Content-Type')) {
           this.type('bin');
killedBy: res .attachment(filename) should set the Content-Type
statusReason: expected "Content-Type" of "image/png", got "image/png; charset=utf-8"

[Killed] ConditionalExpression
lib/response.js:144:18
     case 'object':
       if (chunk === null) {
         chunk = '';
-      } else if (ArrayBuffer.isView(chunk)) {
+      } else if (true) {
         if (!this.get('Content-Type')) {
           this.type('bin');
killedBy: app.router params should overwrite existing req.params by default
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/response.js:145:13
       if (chunk === null) {
         chunk = '';
       } else if (ArrayBuffer.isView(chunk)) {
-        if (!this.get('Content-Type')) {
+        if (false) {
           this.type('bin');
         }
killedBy: res .send(Buffer) should send as octet-stream
statusReason: expected "Content-Type" header field

[Killed] ConditionalExpression
lib/response.js:145:13
       if (chunk === null) {
         chunk = '';
       } else if (ArrayBuffer.isView(chunk)) {
-        if (!this.get('Content-Type')) {
+        if (true) {
           this.type('bin');
         }
killedBy: res .attachment(filename) should set the Content-Type
statusReason: expected "Content-Type" of "image/png", got "application/octet-stream"

[Survived] StringLiteral
lib/response.js:146:21
         chunk = '';
       } else if (ArrayBuffer.isView(chunk)) {
         if (!this.get('Content-Type')) {
-          this.type('bin');
+          this.type("");
         }
       } else {

[Killed] ConditionalExpression
lib/response.js:155:7
   }
 
   // write strings in utf-8
-  if (typeof chunk === 'string') {
+  if (false) {
     encoding = 'utf8';
     type = this.get('Content-Type');
killedBy: res .json(object) should not override previous Content-Types
statusReason: expected "Content-Type" of "application/vnd.example+json; charset=utf-8", got "application/vnd.example+json"

[Survived] StringLiteral
lib/response.js:156:16
 
   // write strings in utf-8
   if (typeof chunk === 'string') {
-    encoding = 'utf8';
+    encoding = "";
     type = this.get('Content-Type');
 

[Killed] StringLiteral
lib/response.js:161:16
 
     // reflect this in content-type
     if (typeof type === 'string') {
-      this.set('Content-Type', setCharset(type, 'utf-8'));
+      this.set("", setCharset(type, 'utf-8'));
     }
   }
killedBy: HEAD should default to GET
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] StringLiteral
lib/response.js:161:49
 
     // reflect this in content-type
     if (typeof type === 'string') {
-      this.set('Content-Type', setCharset(type, 'utf-8'));
+      this.set('Content-Type', setCharset(type, ""));
     }
   }
killedBy: res .json(object) should not override previous Content-Types
statusReason: expected "Content-Type" of "application/vnd.example+json; charset=utf-8", got "application/vnd.example+json"

[Killed] LogicalOperator
lib/response.js:167:22
 
   // determine if ETag should be generated
   var etagFn = app.get('etag fn')
-  var generateETag = !this.get('ETag') && typeof etagFn === 'function'
+  var generateETag = !this.get('ETag') || typeof etagFn === 'function'
 
   // populate Content-Length
killedBy: express.json() encoding should support deflate encoding
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:167:43
 
   // determine if ETag should be generated
   var etagFn = app.get('etag fn')
-  var generateETag = !this.get('ETag') && typeof etagFn === 'function'
+  var generateETag = !this.get('ETag') && true
 
   // populate Content-Length
killedBy: app.route promise support error handling should pass rejected promise without value
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/response.js:171:7
 
   // populate Content-Length
   var len
-  if (chunk !== undefined) {
+  if (chunk === undefined) {
     if (Buffer.isBuffer(chunk)) {
       // get length of Buffer
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:190:7
 
   // populate ETag
   var etag;
-  if (generateETag && len !== undefined) {
+  if (true) {
     if ((etag = etagFn(chunk, encoding))) {
       this.set('ETag', etag);
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:190:7
 
   // populate ETag
   var etag;
-  if (generateETag && len !== undefined) {
+  if (false) {
     if ((etag = etagFn(chunk, encoding))) {
       this.set('ETag', etag);
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/response.js:200:59
   if (req.fresh) this.status(304);
 
   // strip irrelevant headers
-  if (204 === this.statusCode || 304 === this.statusCode) {
-    this.removeHeader('Content-Type');
-    this.removeHeader('Content-Length');
-    this.removeHeader('Transfer-Encoding');
-    chunk = '';
-  }
+  if (204 === this.statusCode || 304 === this.statusCode) {}
 
   // alter headers for 205
killedBy: app .VERB() should only call an error handling routing callback when an error is propagated
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:200:34
   if (req.fresh) this.status(304);
 
   // strip irrelevant headers
-  if (204 === this.statusCode || 304 === this.statusCode) {
+  if (204 === this.statusCode || false) {
     this.removeHeader('Content-Type');
     this.removeHeader('Content-Length');
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:209:32
 
   // alter headers for 205
   if (this.statusCode === 205) {
-    this.set('Content-Length', '0')
+    this.set('Content-Length', "")
     this.removeHeader('Transfer-Encoding')
     chunk = ''
killedBy: res when .statusCode is 205 should strip Transfer-Encoding field and body, set Content-Length
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:242:24
   var app = this.app;
   var escape = app.get('json escape')
   var replacer = app.get('json replacer');
-  var spaces = app.get('json spaces');
+  var spaces = app.get("");
   var body = stringify(obj, replacer, spaces, escape)
 
killedBy: app.router should be .use()able
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/response.js:246:34
   var body = stringify(obj, replacer, spaces, escape)
 
   // content-type
-  if (!this.get('Content-Type')) {
-    this.set('Content-Type', 'application/json');
-  }
+  if (!this.get('Content-Type')) {}
 
   return this.send(body);
killedBy: app.router should be .use()able
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:247:14
 
   // content-type
   if (!this.get('Content-Type')) {
-    this.set('Content-Type', 'application/json');
+    this.set("", 'application/json');
   }
 
killedBy: app.router should be .use()able
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:269:26
   // settings
   var app = this.app;
   var escape = app.get('json escape')
-  var replacer = app.get('json replacer');
+  var replacer = app.get("");
   var spaces = app.get('json spaces');
   var body = stringify(obj, replacer, spaces, escape)
killedBy: res should not override previous Content-Types
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:281:7
   }
 
   // fixup callback
-  if (Array.isArray(callback)) {
+  if (true) {
     callback = callback[0];
   }
killedBy: res should not override previous Content-Types
statusReason: expected "content-type" of "application/vnd.example+json; charset=utf-8", got "text/html; charset=utf-8"

[Killed] EqualityOperator
lib/response.js:286:7
   }
 
   // jsonp
-  if (typeof callback === 'string' && callback.length !== 0) {
+  if (typeof callback !== 'string' && callback.length !== 0) {
     this.set('X-Content-Type-Options', 'nosniff');
     this.set('Content-Type', 'text/javascript');
killedBy: res should not override previous Content-Types
statusReason: expected "content-type" of "application/vnd.example+json; charset=utf-8", got "text/html; charset=utf-8"

[Killed] LogicalOperator
lib/response.js:286:7
   }
 
   // jsonp
-  if (typeof callback === 'string' && callback.length !== 0) {
+  if (typeof callback === 'string' || callback.length !== 0) {
     this.set('X-Content-Type-Options', 'nosniff');
     this.set('Content-Type', 'text/javascript');
killedBy: res should not override previous Content-Types
statusReason: expected "content-type" of "application/vnd.example+json; charset=utf-8", got "text/html; charset=utf-8"

[Killed] StringLiteral
lib/response.js:288:14
   // jsonp
   if (typeof callback === 'string' && callback.length !== 0) {
     this.set('X-Content-Type-Options', 'nosniff');
-    this.set('Content-Type', 'text/javascript');
+    this.set("", 'text/javascript');
 
     // restrict callback charset
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected "Content-Type" of "text/javascript; charset=utf-8", got "text/html; charset=utf-8"

[Killed] ConditionalExpression
lib/response.js:293:9
     // restrict callback charset
     callback = callback.replace(/[^\[\]\w$.]/g, '');
 
-    if (body === undefined) {
+    if (false) {
       // empty argument
       body = ''
killedBy: res .jsonp(object) when given undefined should invoke callback with no arguments
statusReason: expected body "/**/ typeof cb === 'function' && cb(undefined);" to match /cb\(\)/

[Killed] ConditionalExpression
lib/response.js:293:9
     // restrict callback charset
     callback = callback.replace(/[^\[\]\w$.]/g, '');
 
-    if (body === undefined) {
+    if (true) {
       // empty argument
       body = ''
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected body "/**/ typeof something === 'function' && something();" to match /something\(\{"count":1\}\);/

[Killed] BlockStatement
lib/response.js:296:42
     if (body === undefined) {
       // empty argument
       body = ''
-    } else if (typeof body === 'string') {
-      // replace chars not allowed in JavaScript that are in JSON
-      body = body
-        .replace(/\u2028/g, '\\u2028')
-        .replace(/\u2029/g, '\\u2029')
-    }
+    } else if (typeof body === 'string') {}
 
     // the /**/ is a specific security mitigation for "Rosetta Flash JSONP abuse"
killedBy: res .jsonp(object) should escape utf whitespace
statusReason: expected body `/**/ typeof foo === 'function' && foo({"str":"    woot"});` to match /foo\(\{"str":"\\u2028 \\u2029 woot"\}\);/

[Survived] StringLiteral
lib/response.js:305:40
 
     // the /**/ is a specific security mitigation for "Rosetta Flash JSONP abuse"
     // the typeof check is just to reduce client error noise
-    body = '/**/ typeof ' + callback + ' === \'function\' && ' + callback + '(' + body + ');';
+    body = '/**/ typeof ' + callback + "" + callback + '(' + body + ');';
   }
 

[NoCoverage] ConditionalExpression
lib/response.js:381:14
   var req = this.req;
   var res = this;
   var next = req.next;
-  var opts = options || {};
+  var opts = false;
 
   if (!path) {

[NoCoverage] ConditionalExpression
lib/response.js:397:7
     opts = {};
   }
 
-  if (!opts.root && !pathIsAbsolute(path)) {
+  if (false) {
     throw new TypeError('path must be absolute or specify root to res.sendFile');
   }

[NoCoverage] ConditionalExpression
lib/response.js:411:16
   // transfer
   sendfile(res, file, opts, function (err) {
     if (done) return done(err);
-    if (err && err.code === 'EISDIR') return next();
+    if (err && true) return next();
 
     // next() all but write errors

[NoCoverage] EqualityOperator
lib/response.js:414:16
     if (err && err.code === 'EISDIR') return next();
 
     // next() all but write errors
-    if (err && err.code !== 'ECONNABORTED' && err.syscall !== 'write') {
+    if (err && err.code === 'ECONNABORTED' && err.syscall !== 'write') {
       next(err);
     }

[NoCoverage] LogicalOperator
lib/response.js:414:9
     if (err && err.code === 'EISDIR') return next();
 
     // next() all but write errors
-    if (err && err.code !== 'ECONNABORTED' && err.syscall !== 'write') {
+    if (err || err.code !== 'ECONNABORTED' && err.syscall !== 'write') {
       next(err);
     }

[NoCoverage] ConditionalExpression
lib/response.js:441:14
 res.download = function download (path, filename, options, callback) {
   var done = callback;
   var name = filename;
-  var opts = options || null
+  var opts = false
 
   // support function as second or third arg

[NoCoverage] BlockStatement
lib/response.js:444:39
   var opts = options || null
 
   // support function as second or third arg
-  if (typeof filename === 'function') {
-    done = filename;
-    name = null;
-    opts = null
-  } else if (typeof options === 'function') {
+  if (typeof filename === 'function') {} else if (typeof options === 'function') {
     done = options
     opts = null

[NoCoverage] EqualityOperator
lib/response.js:448:14
     done = filename;
     name = null;
     opts = null
-  } else if (typeof options === 'function') {
+  } else if (typeof options !== 'function') {
     done = options
     opts = null

[NoCoverage] ConditionalExpression
lib/response.js:455:6
 
   // support optional filename, where options may be in it's place
   if (typeof filename === 'object' &&
-    (typeof options === 'function' || options === undefined)) {
+    (true)) {
     name = null
     opts = filename

[NoCoverage] ConditionalExpression
lib/response.js:462:47
 
   // set Content-Disposition when file is sent
   var headers = {
-    'Content-Disposition': contentDisposition(name || path)
+    'Content-Disposition': contentDisposition(true)
   };
 

[NoCoverage] BlockStatement
lib/response.js:466:29
   };
 
   // merge user-provided headers
-  if (opts && opts.headers) {
-    var keys = Object.keys(opts.headers)
-    for (var i = 0; i < keys.length; i++) {
-      var key = keys[i]
-      if (key.toLowerCase() !== 'content-disposition') {
-        headers[key] = opts.headers[key]
-      }
-    }
-  }
+  if (opts && opts.headers) {}
 
   // merge user-provided options

[NoCoverage] EqualityOperator
lib/response.js:468:21
   // merge user-provided headers
   if (opts && opts.headers) {
     var keys = Object.keys(opts.headers)
-    for (var i = 0; i < keys.length; i++) {
+    for (var i = 0; i <= keys.length; i++) {
       var key = keys[i]
       if (key.toLowerCase() !== 'content-disposition') {

[NoCoverage] ConditionalExpression
lib/response.js:470:11
     var keys = Object.keys(opts.headers)
     for (var i = 0; i < keys.length; i++) {
       var key = keys[i]
-      if (key.toLowerCase() !== 'content-disposition') {
+      if (false) {
         headers[key] = opts.headers[key]
       }

[Killed] EqualityOperator
lib/response.js:510:12
 
 res.contentType =
 res.type = function contentType(type) {
-  var ct = type.indexOf('/') === -1
+  var ct = type.indexOf('/') !== -1
     ? (mime.contentType(type) || 'application/octet-stream')
     : type;
killedBy: app.router methods should include REBIND
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:511:8
 res.contentType =
 res.type = function contentType(type) {
   var ct = type.indexOf('/') === -1
-    ? (mime.contentType(type) || 'application/octet-stream')
+    ? (true)
     : type;
 
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:514:19
     ? (mime.contentType(type) || 'application/octet-stream')
     : type;
 
-  return this.set('Content-Type', ct);
+  return this.set("", ct);
 };
 
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/response.js:579:35
   var next = req.next;
 
   var keys = Object.keys(obj)
-    .filter(function (v) { return v !== 'default' })
+    .filter(function (v) { return v === 'default' })
 
   var key = keys.length > 0
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/response.js:581:13
   var keys = Object.keys(obj)
     .filter(function (v) { return v !== 'default' })
 
-  var key = keys.length > 0
+  var key = keys.length <= 0
     ? req.accepts(keys)
     : false;
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/response.js:610:17
  */
 
 res.attachment = function attachment(filename) {
-  if (filename) {
-    this.type(extname(filename));
-  }
+  if (filename) {}
 
   this.set('Content-Disposition', contentDisposition(filename));
killedBy: res .attachment(filename) should add the filename param
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:614:12
     this.type(extname(filename));
   }
 
-  this.set('Content-Disposition', contentDisposition(filename));
+  this.set("", contentDisposition(filename));
 
   return this;
killedBy: res .attachment() should Content-Disposition to attachment
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:638:7
   var prev = this.get(field);
   var value = val;
 
-  if (prev) {
+  if (false) {
     // concat the new and prev vals
     value = Array.isArray(prev) ? prev.concat(val)
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')

[NoCoverage] ArrayDeclaration
lib/response.js:641:30
   if (prev) {
     // concat the new and prev vals
     value = Array.isArray(prev) ? prev.concat(val)
-      : Array.isArray(val) ? [prev].concat(val)
+      : Array.isArray(val) ? [].concat(val)
         : [prev, val]
   }

[Killed] ArrayDeclaration
lib/response.js:642:11
     // concat the new and prev vals
     value = Array.isArray(prev) ? prev.concat(val)
       : Array.isArray(val) ? [prev].concat(val)
-        : [prev, val]
+        : []
   }
 
killedBy: res .append(field, val) should append multiple headers
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:671:7
 
 res.set =
 res.header = function header(field, val) {
-  if (arguments.length === 2) {
+  if (true) {
     var value = Array.isArray(val)
       ? val.map(String)
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/response.js:677:49
       : String(val);
 
     // add charset to content-type
-    if (field.toLowerCase() === 'content-type') {
-      if (Array.isArray(value)) {
-        throw new TypeError('Content-Type cannot be set to an Array');
-      }
-      value = mime.contentType(value)
-    }
+    if (field.toLowerCase() === 'content-type') {}
 
     this.setHeader(field, value);
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:678:11
 
     // add charset to content-type
     if (field.toLowerCase() === 'content-type') {
-      if (Array.isArray(value)) {
+      if (false) {
         throw new TypeError('Content-Type cannot be set to an Array');
       }
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:679:29
     // add charset to content-type
     if (field.toLowerCase() === 'content-type') {
       if (Array.isArray(value)) {
-        throw new TypeError('Content-Type cannot be set to an Array');
+        throw new TypeError("");
       }
       value = mime.contentType(value)
killedBy: res .set(field, values) should throw when Content-Type is an array
statusReason: Cannot read properties of null (reading 'port')

[Killed] BooleanLiteral
lib/response.js:752:17
   var secret = this.req.secret;
   var signed = opts.signed;
 
-  if (signed && !secret) {
+  if (signed && secret) {
     throw new Error('cookieParser("secret") required for signed cookies');
   }
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')
