[Killed] BlockStatement
lib/response.js:752:26
   var secret = this.req.secret;
   var signed = opts.signed;
 
-  if (signed && !secret) {
-    throw new Error('cookieParser("secret") required for signed cookies');
-  }
+  if (signed && !secret) {}
 
   var val = typeof value === 'object'
killedBy: res .cookie(name, string, options) signed without secret should throw an error
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/response.js:756:13
     throw new Error('cookieParser("secret") required for signed cookies');
   }
 
-  var val = typeof value === 'object'
+  var val = typeof value !== 'object'
     ? 'j:' + JSON.stringify(value)
     : String(value);
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:760:7
     ? 'j:' + JSON.stringify(value)
     : String(value);
 
-  if (signed) {
+  if (true) {
     val = 's:' + sign(val, secret);
   }
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:761:11
     : String(value);
 
   if (signed) {
-    val = 's:' + sign(val, secret);
+    val = "" + sign(val, secret);
   }
 
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:764:7
     val = 's:' + sign(val, secret);
   }
 
-  if (opts.maxAge != null) {
+  if (false) {
     var maxAge = opts.maxAge - 0
 
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:767:9
   if (opts.maxAge != null) {
     var maxAge = opts.maxAge - 0
 
-    if (!isNaN(maxAge)) {
+    if (false) {
       opts.expires = new Date(Date.now() + maxAge)
       opts.maxAge = Math.floor(maxAge / 1000)
killedBy: res .cookie(name, string, options) maxAge should set relative expires
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/response.js:773:7
     }
   }
 
-  if (opts.path == null) {
+  if (opts.path != null) {
     opts.path = '/';
   }
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:774:17
   }
 
   if (opts.path == null) {
-    opts.path = '/';
+    opts.path = "";
   }
 
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:777:15
     opts.path = '/';
   }
 
-  this.append('Set-Cookie', cookie.serialize(name, String(val), opts));
+  this.append("", cookie.serialize(name, String(val), opts));
 
   return this;
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:823:7
   var status = 302;
 
   // allow status / url
-  if (arguments.length === 2) {
+  if (true) {
     status = arguments[0]
     address = arguments[1]
killedBy: res .redirect(url) should default to a 302 redirect
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:834:41
   // Support text/{plain,html} by default
   this.format({
     text: function(){
-      body = statuses.message[status] + '. Redirecting to ' + address
+      body = statuses.message[status] + "" + address
     },
 
killedBy: res .redirect(url) should default to a 302 redirect
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/response.js:839:49
 
     html: function(){
       var u = escapeHtml(address);
-      body = '<p>' + statuses.message[status] + '. Redirecting to ' + u + '</p>'
+      body = '<p>' + statuses.message[status] + "" + u + '</p>'
     },
 
killedBy: res when accepting html should respond with html
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/response.js:851:35
   this.status(status);
   this.set('Content-Length', Buffer.byteLength(body));
 
-  if (this.req.method === 'HEAD') {
-    this.end();
-  } else {
+  if (this.req.method === 'HEAD') {} else {
     this.end(body);
   }
killedBy: res when the request method is HEAD should ignore the body
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:889:14
 res.render = function render(view, options, callback) {
   var app = this.req.app;
   var done = callback;
-  var opts = options || {};
+  var opts = true;
   var req = this.req;
   var self = this;
killedBy: res .render(name) should support absolute paths
statusReason: Cannot read properties of null (reading 'port')

[NoCoverage] ConditionalExpression
lib/response.js:958:16
 
   // finished
   function onfinish(err) {
-    if (err && err.code === 'ECONNRESET') return onaborted();
+    if (err && true) return onaborted();
     if (err) return onerror(err);
     if (done) return;

[NoCoverage] EqualityOperator
lib/response.js:958:16
 
   // finished
   function onfinish(err) {
-    if (err && err.code === 'ECONNRESET') return onaborted();
+    if (err && err.code !== 'ECONNRESET') return onaborted();
     if (err) return onerror(err);
     if (done) return;

[NoCoverage] StringLiteral
lib/response.js:979:11
     streaming = true;
   }
 
-  file.on('directory', ondirectory);
+  file.on("", ondirectory);
   file.on('end', onend);
   file.on('error', onerror);

[NoCoverage] StringLiteral
lib/response.js:981:11
 
   file.on('directory', ondirectory);
   file.on('end', onend);
-  file.on('error', onerror);
+  file.on("", onerror);
   file.on('file', onfile);
   file.on('stream', onstream);

[NoCoverage] StringLiteral
lib/response.js:982:11
   file.on('directory', ondirectory);
   file.on('end', onend);
   file.on('error', onerror);
-  file.on('file', onfile);
+  file.on("", onfile);
   file.on('stream', onstream);
   onFinished(res, onfinish);

[NoCoverage] StringLiteral
lib/response.js:988:13
 
   if (options.headers) {
     // set headers on successful transfer
-    file.on('headers', function headers(res) {
+    file.on("", function headers(res) {
       var obj = options.headers;
       var keys = Object.keys(obj);

[NoCoverage] UpdateOperator
lib/response.js:992:40
       var obj = options.headers;
       var keys = Object.keys(obj);
 
-      for (var i = 0; i < keys.length; i++) {
+      for (var i = 0; i < keys.length; i--) {
         var k = keys[i];
         res.setHeader(k, obj[k]);

[Killed] ConditionalExpression
lib/response.js:1018:14
 function stringify (value, replacer, spaces, escape) {
   // v8 checks arguments.length for optimizing simple call
   // https://bugs.chromium.org/p/v8/issues/detail?id=4730
-  var json = replacer || spaces
+  var json = true
     ? JSON.stringify(value, replacer, spaces)
     : JSON.stringify(value);
killedBy: app.router should be .use()able
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/response.js:1022:7
     ? JSON.stringify(value, replacer, spaces)
     : JSON.stringify(value);
 
-  if (escape && typeof json === 'string') {
+  if (false) {
     json = json.replace(/[<>&]/g, function (c) {
       switch (c.charCodeAt(0)) {
killedBy: app.router should be .use()able
statusReason: Cannot read properties of null (reading 'port')

[Killed] Regex
lib/response.js:1023:25
     : JSON.stringify(value);
 
   if (escape && typeof json === 'string') {
-    json = json.replace(/[<>&]/g, function (c) {
+    json = json.replace(/[^<>&]/g, function (c) {
       switch (c.charCodeAt(0)) {
         case 0x3c:
killedBy: res .json(object) "json escape" setting should unicode escape HTML-sniffing characters
statusReason: Cannot read properties of null (reading 'port')
