[Killed] LogicalOperator
lib/utils.js:62:17
 exports.normalizeType = function(type){
   return ~type.indexOf('/')
     ? acceptParams(type)
-    : { value: (mime.lookup(type) || 'application/octet-stream'), params: {} }
+    : { value: (mime.lookup(type) && 'application/octet-stream'), params: {} }
 };
 
killedBy: res .format(obj) with extnames should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/utils.js:73:42
  * @api private
  */
 
-exports.normalizeTypes = function(types) {
-  return types.map(exports.normalizeType);
-};
+exports.normalizeTypes = function(types) {};
 
 
killedBy: res .format(obj) with canonicalized mime types when no match is made should should respond with 406 not acceptable
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/utils.js:89:32
 
 function acceptParams (str) {
   var length = str.length;
-  var colonIndex = str.indexOf(';');
+  var colonIndex = str.indexOf("");
   var index = colonIndex === -1 ? length : colonIndex;
   var ret = { value: str.slice(0, index).trim(), quality: 1, params: {} };
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:90:15
 function acceptParams (str) {
   var length = str.length;
   var colonIndex = str.indexOf(';');
-  var index = colonIndex === -1 ? length : colonIndex;
+  var index = true ? length : colonIndex;
   var ret = { value: str.slice(0, index).trim(), quality: 1, params: {} };
 
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] UnaryOperator
lib/utils.js:90:30
 function acceptParams (str) {
   var length = str.length;
   var colonIndex = str.indexOf(';');
-  var index = colonIndex === -1 ? length : colonIndex;
+  var index = colonIndex === +1 ? length : colonIndex;
   var ret = { value: str.slice(0, index).trim(), quality: 1, params: {} };
 
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] MethodExpression
lib/utils.js:91:22
   var length = str.length;
   var colonIndex = str.indexOf(';');
   var index = colonIndex === -1 ? length : colonIndex;
-  var ret = { value: str.slice(0, index).trim(), quality: 1, params: {} };
+  var ret = { value: str.slice(0, index), quality: 1, params: {} };
 
   while (index < length) {
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] MethodExpression
lib/utils.js:91:22
   var length = str.length;
   var colonIndex = str.indexOf(';');
   var index = colonIndex === -1 ? length : colonIndex;
-  var ret = { value: str.slice(0, index).trim(), quality: 1, params: {} };
+  var ret = { value: str.trim(), quality: 1, params: {} };
 
   while (index < length) {
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:93:10
   var index = colonIndex === -1 ? length : colonIndex;
   var ret = { value: str.slice(0, index).trim(), quality: 1, params: {} };
 
-  while (index < length) {
+  while (false) {
     var splitIndex = str.indexOf('=', index);
     if (splitIndex === -1) break;
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/utils.js:93:10
   var index = colonIndex === -1 ? length : colonIndex;
   var ret = { value: str.slice(0, index).trim(), quality: 1, params: {} };
 
-  while (index < length) {
+  while (index >= length) {
     var splitIndex = str.indexOf('=', index);
     if (splitIndex === -1) break;
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/utils.js:94:34
   var ret = { value: str.slice(0, index).trim(), quality: 1, params: {} };
 
   while (index < length) {
-    var splitIndex = str.indexOf('=', index);
+    var splitIndex = str.indexOf("", index);
     if (splitIndex === -1) break;
 
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:95:9
 
   while (index < length) {
     var splitIndex = str.indexOf('=', index);
-    if (splitIndex === -1) break;
+    if (false) break;
 
     var colonIndex = str.indexOf(';', index);
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/utils.js:95:9
 
   while (index < length) {
     var splitIndex = str.indexOf('=', index);
-    if (splitIndex === -1) break;
+    if (splitIndex !== -1) break;
 
     var colonIndex = str.indexOf(';', index);
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] UnaryOperator
lib/utils.js:98:35
     if (splitIndex === -1) break;
 
     var colonIndex = str.indexOf(';', index);
-    var endIndex = colonIndex === -1 ? length : colonIndex;
+    var endIndex = colonIndex === +1 ? length : colonIndex;
 
     if (splitIndex > endIndex) {
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:98:20
     if (splitIndex === -1) break;
 
     var colonIndex = str.indexOf(';', index);
-    var endIndex = colonIndex === -1 ? length : colonIndex;
+    var endIndex = false ? length : colonIndex;
 
     if (splitIndex > endIndex) {
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/utils.js:100:32
     var colonIndex = str.indexOf(';', index);
     var endIndex = colonIndex === -1 ? length : colonIndex;
 
-    if (splitIndex > endIndex) {
-      index = str.lastIndexOf(';', splitIndex - 1) + 1;
-      continue;
-    }
+    if (splitIndex > endIndex) {}
 
     var key = str.slice(index, splitIndex).trim();
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:100:9
     var colonIndex = str.indexOf(';', index);
     var endIndex = colonIndex === -1 ? length : colonIndex;
 
-    if (splitIndex > endIndex) {
+    if (false) {
       index = str.lastIndexOf(';', splitIndex - 1) + 1;
       continue;
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] ArithmeticOperator
lib/utils.js:101:36
     var endIndex = colonIndex === -1 ? length : colonIndex;
 
     if (splitIndex > endIndex) {
-      index = str.lastIndexOf(';', splitIndex - 1) + 1;
+      index = str.lastIndexOf(';', splitIndex + 1) + 1;
       continue;
     }
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] ArithmeticOperator
lib/utils.js:101:15
     var endIndex = colonIndex === -1 ? length : colonIndex;
 
     if (splitIndex > endIndex) {
-      index = str.lastIndexOf(';', splitIndex - 1) + 1;
+      index = str.lastIndexOf(';', splitIndex - 1) - 1;
       continue;
     }
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] MethodExpression
lib/utils.js:105:15
       continue;
     }
 
-    var key = str.slice(index, splitIndex).trim();
+    var key = str.slice(index, splitIndex);
     var value = str.slice(splitIndex + 1, endIndex).trim();
 
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] MethodExpression
lib/utils.js:105:15
       continue;
     }
 
-    var key = str.slice(index, splitIndex).trim();
+    var key = str.trim();
     var value = str.slice(splitIndex + 1, endIndex).trim();
 
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] MethodExpression
lib/utils.js:106:17
     }
 
     var key = str.slice(index, splitIndex).trim();
-    var value = str.slice(splitIndex + 1, endIndex).trim();
+    var value = str.slice(splitIndex + 1, endIndex);
 
     if (key === 'q') {
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] MethodExpression
lib/utils.js:106:17
     }
 
     var key = str.slice(index, splitIndex).trim();
-    var value = str.slice(splitIndex + 1, endIndex).trim();
+    var value = str.trim();
 
     if (key === 'q') {
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/utils.js:108:9
     var key = str.slice(index, splitIndex).trim();
     var value = str.slice(splitIndex + 1, endIndex).trim();
 
-    if (key === 'q') {
+    if (key !== 'q') {
       ret.quality = parseFloat(value);
     } else {
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:108:9
     var key = str.slice(index, splitIndex).trim();
     var value = str.slice(splitIndex + 1, endIndex).trim();
 
-    if (key === 'q') {
+    if (true) {
       ret.quality = parseFloat(value);
     } else {
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/utils.js:110:12
 
     if (key === 'q') {
       ret.quality = parseFloat(value);
-    } else {
-      ret.params[key] = value;
-    }
+    } else {}
 
     index = endIndex + 1;
killedBy: res .format(obj) with parameters should default the Content-Type
statusReason: Cannot read properties of null (reading 'port')

[Killed] ArithmeticOperator
lib/utils.js:114:13
       ret.params[key] = value;
     }
 
-    index = endIndex + 1;
+    index = endIndex - 1;
   }
 
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/utils.js:163:7
 exports.compileQueryParser = function compileQueryParser(val) {
   var fn;
 
-  if (typeof val === 'function') {
+  if (typeof val !== 'function') {
     return val;
   }
killedBy: express.static() when request has "Range" header should support n-
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:200:7
     return function(){ return true };
   }
 
-  if (typeof val === 'number') {
+  if (false) {
     // Support trusting hop count
     return function(a, i){ return i < val };
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:202:35
 
   if (typeof val === 'number') {
     // Support trusting hop count
-    return function(a, i){ return i < val };
+    return function(a, i){ return true };
   }
 
killedBy: req .host when "trust proxy" is enabled when trusting hop count should respect X-Forwarded-Host
statusReason: Cannot read properties of null (reading 'port')

[Killed] EqualityOperator
lib/utils.js:202:35
 
   if (typeof val === 'number') {
     // Support trusting hop count
-    return function(a, i){ return i < val };
+    return function(a, i){ return i >= val };
   }
 
killedBy: req .host when "trust proxy" is enabled when trusting hop count should respect X-Forwarded-Host
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/utils.js:224:7
  */
 
 exports.setCharset = function setCharset(type, charset) {
-  if (!type || !charset) {
+  if (true) {
     return type;
   }
killedBy: HEAD should default to GET
statusReason: Cannot read properties of null (reading 'port')
