[Killed] StringLiteral
lib/application.js:17:30
  */
 
 var finalhandler = require('finalhandler');
-var debug = require('debug')('express:application');
+var debug = require('debug')("");
 var View = require('./view');
 var http = require('node:http');
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/application.js:94:15
   var env = process.env.NODE_ENV || 'development';
 
   // default settings
-  this.enable('x-powered-by');
+  this.enable("");
   this.set('etag', 'weak');
   this.set('env', env);
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/application.js:99:12
   this.set('env', env);
   this.set('query parser', 'simple')
   this.set('subdomain offset', 2);
-  this.set('trust proxy', false);
+  this.set("", false);
 
   // trust proxy inherit back-compat
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] BlockStatement
lib/application.js:109:45
 
   debug('booting in %s mode', env);
 
-  this.on('mount', function onmount(parent) {
-    // inherit trust proxy
-    if (this.settings[trustProxyDefaultSymbol] === true
-      && typeof parent.settings['trust proxy fn'] === 'function') {
-      delete this.settings['trust proxy'];
-      delete this.settings['trust proxy fn'];
-    }
-
-    // inherit protos
-    Object.setPrototypeOf(this.request, parent.request)
-    Object.setPrototypeOf(this.response, parent.response)
-    Object.setPrototypeOf(this.engines, parent.engines)
-    Object.setPrototypeOf(this.settings, parent.settings)
-  });
+  this.on('mount', function onmount(parent) {});
 
   // setup locals
killedBy: app .request should inherit to sub apps
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] StringLiteral
lib/application.js:128:20
   this.locals = Object.create(null);
 
   // top-most app is mounted at /
-  this.mountpath = '/';
+  this.mountpath = "";
 
   // default locals
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/application.js:135:12
 
   // default configuration
   this.set('view', View);
-  this.set('views', resolve('views'));
+  this.set("", resolve('views'));
   this.set('jsonp callback name', 'callback');
 
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/application.js:136:35
   // default configuration
   this.set('view', View);
   this.set('views', resolve('views'));
-  this.set('jsonp callback name', 'callback');
+  this.set('jsonp callback name', "");
 
   if (env === 'production') {
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Survived] ConditionalExpression
lib/application.js:160:7
   });
 
   // set powered by header
-  if (this.enabled('x-powered-by')) {
+  if (true) {
     res.setHeader('X-Powered-By', 'Express');
   }

[Survived] StringLiteral
lib/application.js:161:35
 
   // set powered by header
   if (this.enabled('x-powered-by')) {
-    res.setHeader('X-Powered-By', 'Express');
+    res.setHeader('X-Powered-By', "");
   }
 

[Killed] BlockStatement
lib/application.js:219:29
   // get router
   var router = this.router;
 
-  fns.forEach(function (fn) {
-    // non-express app
-    if (!fn || !fn.handle || !fn.set) {
-      return router.use(path, fn);
-    }
-
-    debug('.use app under %s', path);
-    fn.mountpath = path;
-    fn.parent = this;
-
-    // restore .app property on req and res
-    router.use(path, function mounted_app(req, res, next) {
-      var orig = req.app;
-      fn.handle(req, res, function (err) {
-        Object.setPrototypeOf(req, orig.request)
-        Object.setPrototypeOf(res, orig.response)
-        next(err);
-      });
-    });
-
-    // mounted an app
-    fn.emit('mount', this);
-  }, this);
+  fns.forEach(function (fn) {}, this);
 
   return this;
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] LogicalOperator
lib/application.js:221:9
 
   fns.forEach(function (fn) {
     // non-express app
-    if (!fn || !fn.handle || !fn.set) {
+    if (!fn && !fn.handle || !fn.set) {
       return router.use(path, fn);
     }
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] ConditionalExpression
lib/application.js:221:9
 
   fns.forEach(function (fn) {
     // non-express app
-    if (!fn || !fn.handle || !fn.set) {
+    if (false || !fn.set) {
       return router.use(path, fn);
     }
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Timeout] BlockStatement
lib/application.js:230:59
     fn.parent = this;
 
     // restore .app property on req and res
-    router.use(path, function mounted_app(req, res, next) {
-      var orig = req.app;
-      fn.handle(req, res, function (err) {
-        Object.setPrototypeOf(req, orig.request)
-        Object.setPrototypeOf(res, orig.response)
-        next(err);
-      });
-    });
+    router.use(path, function mounted_app(req, res, next) {});
 
     // mounted an app

[Timeout] BlockStatement
lib/application.js:232:42
     // restore .app property on req and res
     router.use(path, function mounted_app(req, res, next) {
       var orig = req.app;
-      fn.handle(req, res, function (err) {
-        Object.setPrototypeOf(req, orig.request)
-        Object.setPrototypeOf(res, orig.response)
-        next(err);
-      });
+      fn.handle(req, res, function (err) {});
     });
 

[Killed] StringLiteral
lib/application.js:301:7
 
   // get file extension
   var extension = ext[0] !== '.'
-    ? '.' + ext
+    ? "" + ext
     : ext;
 
killedBy: app .engine(ext, fn) should work without leading "."
statusReason: Cannot find module 'html'
Require stack:
- /home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/lib/view.js
- /home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/lib/application.js
- /home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/lib/express.js
- /home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/index.js
- /home/aloisio/projetos/testes/

[Killed] UpdateOperator
lib/application.js:324:38
 
 app.param = function param(name, fn) {
   if (Array.isArray(name)) {
-    for (var i = 0; i < name.length; i++) {
+    for (var i = 0; i < name.length; i--) {
       this.param(name[i], fn);
     }
killedBy: app .param(names, fn) should map the array
statusReason: argument name is required

[Killed] StringLiteral
lib/application.js:365:16
   // trigger matched settings
   switch (setting) {
     case 'etag':
-      this.set('etag fn', compileETag(val));
+      this.set("", compileETag(val));
       break;
     case 'query parser':
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] StringLiteral
lib/application.js:371:16
       this.set('query parser fn', compileQueryParser(val));
       break;
     case 'trust proxy':
-      this.set('trust proxy fn', compileTrust(val));
+      this.set("", compileTrust(val));
 
       // trust proxy inherit back-compat
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'port')

[Killed] UpdateOperator
lib/application.js:498:39
   var route = this.route(path);
   var args = slice.call(arguments, 1);
 
-  for (var i = 0; i < methods.length; i++) {
+  for (var i = 0; i < methods.length; i--) {
     route[methods[i]].apply(route, args);
   }
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of undefined (reading 'apply')

[Killed] EqualityOperator
lib/application.js:498:19
   var route = this.route(path);
   var args = slice.call(arguments, 1);
 
-  for (var i = 0; i < methods.length; i++) {
+  for (var i = 0; i >= methods.length; i++) {
     route[methods[i]].apply(route, args);
   }
killedBy: app.all() should add a router per method
statusReason: expected 200 "OK", got 404 "Not Found"

[Killed] EqualityOperator
lib/application.js:539:7
   var renderOptions = { ...this.locals, ...opts._locals, ...opts };
 
   // set .cache unless explicitly provided
-  if (renderOptions.cache == null) {
+  if (renderOptions.cache != null) {
     renderOptions.cache = this.enabled('view cache');
   }
killedBy: app .render(name, fn) caching should cache with "view cache" setting
statusReason: Expected values to be strictly equal:

2 !== 1

[Killed] BooleanLiteral
lib/application.js:549:7
   }
 
   // view
-  if (!view) {
+  if (view) {
     var View = this.get('view');
 
killedBy: app .engine(ext, fn) should map a template engine
statusReason: Cannot read properties of undefined (reading 'render')

[Killed] StringLiteral
lib/application.js:554:22
 
     view = new View(name, {
       defaultEngine: this.get('view engine'),
-      root: this.get('views'),
+      root: this.get(""),
       engines: engines
     });
killedBy: app .engine(ext, fn) should map a template engine
statusReason: The "paths[0]" argument must be of type string. Received undefined

[Killed] ConditionalExpression
lib/application.js:558:9
       engines: engines
     });
 
-    if (!view.path) {
+    if (true) {
       var dirs = Array.isArray(view.root) && view.root.length > 1
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
killedBy: app .engine(ext, fn) should map a template engine
statusReason: Failed to lookup view "user.html" in views directory "/home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/test/fixtures"

[Killed] EqualityOperator
lib/application.js:559:46
     });
 
     if (!view.path) {
-      var dirs = Array.isArray(view.root) && view.root.length > 1
+      var dirs = Array.isArray(view.root) && view.root.length <= 1
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
         : 'directory "' + view.root + '"'
killedBy: app .render(name, fn) when "views" is given when array of paths should error if file does not exist

[Killed] StringLiteral
lib/application.js:561:11
     if (!view.path) {
       var dirs = Array.isArray(view.root) && view.root.length > 1
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
-        : 'directory "' + view.root + '"'
+        : "" + view.root + '"'
       var err = new Error('Failed to lookup view "' + name + '" in views ' + dirs);
       err.view = view;
killedBy: app .render(name, fn) when the file does not exist should provide a helpful error
statusReason: 'Failed to lookup view "rawr.tmpl" in views /home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/test/fixtures"' == 'Failed to lookup view "rawr.tmpl" in views directory "/home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/test/fixtures"'

[Killed] StringLiteral
lib/application.js:562:27
       var dirs = Array.isArray(view.root) && view.root.length > 1
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
         : 'directory "' + view.root + '"'
-      var err = new Error('Failed to lookup view "' + name + '" in views ' + dirs);
+      var err = new Error("" + name + '" in views ' + dirs);
       err.view = view;
       return done(err);
killedBy: app .render(name, fn) when the file does not exist should provide a helpful error
statusReason: 'rawr.tmpl" in views directory "/home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/test/fixtures"' == 'Failed to lookup view "rawr.tmpl" in views directory "/home/aloisio/projetos/testes/express/.stryker-tmp/sandbox-Mj8lhJ/test/fixtures"'
